7767517
32 33
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 9=1
Convolution              convrelu_1               1 1 1 2 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Pooling                  maxpool2d_19             1 1 2 3 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_2               1 1 3 4 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=1
Convolution              convrelu_3               1 1 4 5 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Pooling                  maxpool2d_20             1 1 5 6 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_4               1 1 6 7 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=1
Convolution              convrelu_5               1 1 7 8 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Pooling                  maxpool2d_21             1 1 8 9 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_6               1 1 9 10 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
Convolution              convrelu_7               1 1 10 11 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Pooling                  maxpool2d_22             1 1 11 12 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_8               1 1 12 13 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=1
Convolution              convrelu_9               1 1 13 14 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Pooling                  maxpool2d_23             1 1 14 15 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Split                    splitncnn_0              1 2 15 16 17
Pooling                  gap_0                    1 1 17 18 0=1 4=1
Reshape                  reshape_41               1 1 18 19 0=512
InnerProduct             fcrelu_0                 1 1 19 20 0=32 1=1 2=16384 9=1
InnerProduct             fcsigmoid_3              1 1 20 21 0=512 1=1 2=16384 9=4
Reshape                  reshape_42               1 1 21 22 0=1 1=1 2=512
BinaryOp                 mul_0                    2 1 16 22 23 0=2
Convolution              convrelu_10              1 1 23 24 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Convolution              convrelu_11              1 1 24 25 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Pooling                  maxpool2d_24             1 1 25 26 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Pooling                  gap_1                    1 1 26 27 0=1 4=1
Reshape                  reshape_43               1 1 27 28 0=1 1=1 2=-1
Flatten                  flatten_44               1 1 28 29
InnerProduct             fcrelu_1                 1 1 29 30 0=256 1=1 2=131072 9=1
InnerProduct             fcrelu_2                 1 1 30 31 0=64 1=1 2=16384 9=1
InnerProduct             linear_18                1 1 31 out0 0=1 1=1 2=64
