7767517
72 82
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 9=1
Convolution              convrelu_1               1 1 1 2 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=9216 9=1
Convolution              convrelu_2               1 1 2 3 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              convrelu_3               1 1 3 4 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=27648 9=1
Convolution              convrelu_4               1 1 4 5 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144 9=1
ConvolutionDepthWise     convdw_67                1 1 5 6 0=64 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1600 7=64
Convolution              convrelu_5               1 1 6 7 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288 9=1
ConvolutionDepthWise     convdwrelu_0             1 1 7 8 0=192 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=4800 7=192 9=1
Convolution              conv_7                   1 1 8 9 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Split                    splitncnn_0              1 2 9 10 11
Convolution              convrelu_6               1 1 11 12 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 12 13 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192 9=1
Convolution              conv_9                   1 1 13 14 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
BinaryOp                 add_0                    2 1 14 10 15 0=0
Split                    splitncnn_1              1 2 15 16 17
Convolution              convrelu_7               1 1 17 18 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 18 19 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192 9=1
Convolution              conv_11                  1 1 19 20 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
BinaryOp                 add_1                    2 1 20 16 21 0=0
Split                    splitncnn_2              1 2 21 22 23
Convolution              convrelu_8               1 1 23 24 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=1
ConvolutionDepthWise     convdwrelu_3             1 1 24 25 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192 9=1
Convolution              conv_13                  1 1 25 26 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
BinaryOp                 add_2                    2 1 26 22 27 0=0
Split                    splitncnn_3              1 2 27 28 29
Convolution              convrelu_9               1 1 29 30 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=1
ConvolutionDepthWise     convdwrelu_4             1 1 30 31 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192 9=1
Convolution              conv_15                  1 1 31 32 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
BinaryOp                 add_3                    2 1 32 28 33 0=0
Split                    splitncnn_4              1 2 33 34 35
ConvolutionDepthWise     convdw_73                1 1 35 36 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Convolution              convrelu_10              1 1 36 37 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=1
Convolution              conv_17                  1 1 37 38 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
BinaryOp                 add_4                    2 1 38 34 39 0=0
ConvolutionDepthWise     convdw_74                1 1 39 40 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Convolution              convrelu_11              1 1 40 41 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296 9=1
ConvolutionDepthWise     convdwrelu_5             1 1 41 42 0=576 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=5184 7=576 9=1
Convolution              conv_19                  1 1 42 43 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Split                    splitncnn_5              1 2 43 44 45
ConvolutionDepthWise     convdw_76                1 1 45 46 0=128 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3200 7=128
Convolution              convrelu_12              1 1 46 47 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_6             1 1 47 48 0=512 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=12800 7=512 9=1
Convolution              conv_21                  1 1 48 49 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_5                    2 1 49 44 50 0=0
Split                    splitncnn_6              1 2 50 51 52
Convolution              convrelu_13              1 1 52 53 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_7             1 1 53 54 0=512 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=12800 7=512 9=1
Convolution              conv_23                  1 1 54 55 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_6                    2 1 55 51 56 0=0
Split                    splitncnn_7              1 2 56 57 58
Convolution              convrelu_14              1 1 58 59 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152 9=1
ConvolutionDepthWise     convdwrelu_8             1 1 59 60 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384 9=1
Convolution              conv_25                  1 1 60 61 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
BinaryOp                 add_7                    2 1 61 57 62 0=0
Split                    splitncnn_8              1 2 62 63 64
Convolution              convrelu_15              1 1 64 65 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_9             1 1 65 66 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512 9=1
Convolution              conv_27                  1 1 66 67 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_8                    2 1 67 63 68 0=0
Split                    splitncnn_9              1 2 68 69 70
Convolution              convrelu_16              1 1 70 71 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_10            1 1 71 72 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512 9=1
Convolution              conv_29                  1 1 72 73 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_9                    2 1 73 69 74 0=0
Convolution              convrelu_17              1 1 74 75 0=960 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=122880 9=1
Pooling                  gap_0                    1 1 75 76 0=1 4=1
Convolution              convrelu_18              1 1 76 77 0=1280 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1228800 9=1
Reshape                  reshape_65               1 1 77 78 0=1 1=1 2=-1
Flatten                  flatten_66               1 1 78 79
InnerProduct             fcrelu_0                 1 1 79 80 0=256 1=1 2=327680 9=1
InnerProduct             linear_33                1 1 80 out0 0=1 1=1 2=256
